/** @file
  Copyright ©2021 Liu Yi, efikarl@yeah.net

  This program is just made available under the terms and conditions of the
  MIT license: http://www.efikarl.com/mit-license.html

  THE PROGRAM IS DISTRIBUTED UNDER THE MIT LICENSE ON AN "AS IS" BASIS,
  WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.
--*/

#langdef en "English"

#string STR_SAMPLE_FORM1_TITLE          #language en  "Sample Form 1"
#string STR_SAMPLE_FORM2_TITLE          #language en  "Sample Form 2"
#string STR_SAMPLE_FORM3_TITLE          #language en  "Sample Form 3"
#string STR_SAMPLE_FORM4_TITLE          #language en  "Sample Form 4"
#string STR_GOTO_FORMSET1_PROMPT        #language en  "Goto FormSet 1 Prompt"
#string STR_GOTO_FORMSET2_PROMPT        #language en  "Goto FormSet 2 Prompt"
#string STR_GOTO_FORMSETN_HELP          #language en  "Go To This FormSet"
#string STR_GOTO_FORM1_PROMPT           #language en  "Goto Form 1 Prompt"
#string STR_GOTO_FORM2_PROMPT           #language en  "Goto Form 2 Prompt"
#string STR_GOTO_FORM3_PROMPT           #language en  "Goto Form 3 Prompt"
#string STR_GOTO_FORM4_PROMPT           #language en  "Goto Form 4 Prompt"
#string STR_GOTO_FORMN_HELP             #language en  "Go To This Form"
#string STR_TEXT_HELP                   #language en  "This Is Help(?)"

#string STR_NA                          #language en  "N/A"
#string STR_NONE                        #language en  ""
#string STR_ON                          #language en  "On"
#string STR_OFF                         #language en  "Off"
#string STR_EXIT                        #language en  "Exit"
#string STR_SAVE                        #language en  "Save"
#string STR_FORM_ASIS_AND_EXIT          #language en  "Current Form AsIs And Exit"
#string STR_FORM_SAVE_AND_EXIT          #language en  "Current Form Save And Exit"
#string STR_GOTO_FORM1_PROMPT           #language en  "Goto Form 1 Prompt"

#string STR_WHO_I_AM                    #language en  "Who I Am?"
#string STR_I_AM_WHO                    #language en  "N/A"
#string STR_QID_UNIQUE_PROMPT           #language en  "QuestionId Is Unique"
#string STR_QID_UNIQUE_HELP             #language en  "QuestionId Is Unique (Help)"
#string STR_CHECKBOX_PROMPT             #language en  "This Is CheckBox"
#string STR_CHECKBOX_HELP               #language en  "Help Of CheckBox"
#string STR_NUMERIC_PROMPT              #language en  "This Is Numeric"
#string STR_NUMERIC_HELP                #language en  "Help Of Numeric"
#string STR_ONE_OF_PROMPT               #language en  "This Is OneOf"
#string STR_ONE_OF_HELP                 #language en  "Help Of OneOf"
#string STR_ONE_OF_OPT1                 #language en  "Opt1 In OneOf"
#string STR_ONE_OF_OPT2                 #language en  "Opt2 In OneOf"
#string STR_ONE_OF_OPT3                 #language en  "Opt3 In OneOf"
#string STR_ONE_OF_OPT4                 #language en  "Opt4 In OneOf"
#string STR_STRING_PROMPT               #language en  "This Is String"
#string STR_STRING_HELP                 #language en  "Help Of String"
#string STR_ORDERED_LIST_PROMPT         #language en  "This Is OrderedList"
#string STR_ORDERED_LIST_HELP           #language en  "Help Of OrderedList"
#string STR_BOOT_OPTION1                #language en  "Boot Option#1"
#string STR_BOOT_OPTION2                #language en  "Boot Option#2"
#string STR_BOOT_OPTION3                #language en  "Boot Option#3"
#string STR_BOOT_OPTION4                #language en  "Boot Option#4"